#Домашнє завдання: Модуль - 4, завдання - 3 (не обов'язкове). Python Core 2.0. (PYTHON SOFTWARE ENGINEERING. Гнучкий формат)
'''
ОПИС:
    Скрипт, який приймає шлях до директорії в якості аргументу командного рядка та візуалізує
    структуру цієї директорії, виводячи імена всіх піддиректорій та файлів. Для кращого візуального
    сприйняття, імена директорій та файлів відрізняються за кольорами.
ВХІДНІ ПАРАМЕТРИ:
    шлях до директорії в якості аргументу командного рядка.
ВИХІДНІ ДАНІ:
    візуалізація структури директорії з кольоровим розділенням файлів та директорій.
ВИНЯТКИ:
    - якщо аргемент не було введено, то виникне відповідне повідомлення із попередженням.
    - якщо аргумент введено, але такої директорії не існує, то виникне відповідне повідомлення
        із попередженням.
ПРИКЛАД ВИКОРИСТАННЯ:
    в terminal потрібно написати наступне:
    python main_hw_4_3.py ./picture
'''
#Імпорт необхідних класів та функцій із модулів
from pathlib import Path
from colorama import Fore, Back, Style
from sys import argv
# Перевірка наявності передачі <шляху до директорії> в якості аргумента командного рядка
if len(argv)>1:
    directory = Path(argv[1])
else:
    # Відповідне повідомлення про відсутність <шляху до директорії> в якості аргумента командного рядка та завершиння роботи
    print(f"{Fore.YELLOW}{Back.RED}Введіть в консолі шлях до директорії в якості аргументу!!!{Style.RESET_ALL}")
    exit()
# Функція, що виконує кольорову візуалізацію структури директорії рекурсивним способом обходу директорій
def file_tree(path):
    # Обробка винятків FileNotFoundError
    try:
        for item in path.iterdir():            
            if item.is_file():
                print(f"{Fore.BLUE}{item.parent}\{Fore.GREEN}{item.name}{Style.RESET_ALL}")
            else:
                print(f"{Fore.BLUE}{item}{Style.RESET_ALL}")
            if item.is_dir():
                file_tree(item)
    # Виведення відповідного повідомлення для винятка FileNotFoundError
    except FileNotFoundError:
        print(f"{Fore.WHITE}{Back.RED}({path}){Fore.RED}{Back.RESET} <-- дану директорію не знайдено, спробуйте іншу{Style.RESET_ALL}")
# Виклик функції із аргументом, що вказує на шлях до директорії, що потрібно візуалізувати
file_tree(directory)