#Домашнє завдання: Модуль - 4, завдання - 2. Python Core 2.0. (PYTHON SOFTWARE ENGINEERING. Гнучкий формат)
'''
ОПИС:
    Функція, яка читає текстовий файл та повертає список словників з інформацією про кожного кота.
ВХІДНІ ПАРАМЕТРИ:
    path — рядок (str), шлях до текстового файлу.
ВИХІДНІ ДАНІ:
    cat_list - список словників (list) з інформацією про кожного кота.
ВИНЯТКИ:
    Якщо функція не може знайти необхідний файл, то виникає обробка даного винятка (FileNotFoundError) та вивединня відповідного повідомлення.
    Сама функція при цьому повертає пустий список.
ПРИКЛАД ВИКОРИСТАННЯ:
    cats_info = get_cats_info("./cats_file.txt")
    print(cats_info)
'''
def get_cats_info(path):
    # Ініціалізація
    cat_list = []
    keys = ["id","name","age"]
    try:
        # Відкриття файлу для читання, використовуючи менеджер контексту
        with open(file=path, mode="r", encoding="utf-8") as fh:
            # Початок циклу читання та підготовки необхідних даних
            while True:
                # Читання по-рядково до кінця файлу із видаленням пробілів та перносів (\n) по краях
                line_value = fh.readline().strip()
                if not line_value:
                    break
                # Створення списку значень, отриманих із текстового файлу
                line_value = line_value.split(",")
                # Створення словника для кожного кота окремо
                cat_dict = dict(zip(keys, line_value))
                # Створення списку із окремих словників
                cat_list.append(cat_dict)
        # Повернення функцією списку словників із даними про котів
        return cat_list
    # Обробка винятка FileNotFoundError
    except FileNotFoundError:
        print(f"Файл'{path}' не знайдено, перевірте правильність шляху!")
        return []

