#Домашнє завдання: Модуль - 4, завдання - 1. Python Core 2.0. (PYTHON SOFTWARE ENGINEERING. Гнучкий формат)
'''
ОПИС:
    Функція, яка аналізує текстовий файл та повертає загальну та середню суму заробітної плати всіх працівників, що вказані у файлі.
ВХІДНІ ПАРАМЕТРИ:
    path — рядок (str), шлях до текстового файлу.
ВИХІДНІ ДАНІ:
    кортеж (tuple) - із двох чисел: загальної суми зарплат та середньої заробітної плати.
ВИНЯТКИ:
    Якщо функція не може знайти необхідний файл, то виникає обробка даного винятка (FileNotFoundError) та вивединня відповідного повідомлення.
    Сама функція при цьому повертає кортеж із пустими значеннями.
ПРИКЛАД ВИКОРИСТАННЯ:
    total, average = total_salary("./salary_file.txt")
    print(f"Загальна сума заробітної плати: {total}, Середня заробітна плата: {average}")
'''
def total_salary(path):    
    # Ініціалізація списку зарплат та змінних total та average (загальна та середня суми зарплат відповідно)
    salary_list =[]
    total=average=0
    try:
        # Відкриття файлу для читання, використовуючи менеджер контексту
        with open(file=path, mode="r", encoding="utf-8") as fh:
            # Початок циклу читання та підготовки необхідних даних
            while True:
                # Читання по-рядково до кінця файлу із видаленням пробілів та перносів (\n) по краях
                line = fh.readline().strip()
                # Закінчення циклу при досягненні кінця даних у текстовому файлі
                if not line:
                    break
                # Створення списку із значень зарплат
                line = line.split(",")[1]
                salary_list.append(int(line))
            # Розрахунок загальної (total) та середньої (average) суми зарплат
            for salary in salary_list:
                total += salary
            average = total/len(salary_list)
        # Повернення функцією кортежу (tuple) із двох значень (загальна та середня суми зарплат)
        return (int(total),int(average))
    # Обробка винятка FileNotFoundError
    except FileNotFoundError:
        print(f"Файл'{path}' не знайдено, перевірте правильність шляху!")
        return ("","")